# ControlledApplication Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIControlledApplication..::..ControlledApplication Property
UIControlledApplication Class See Also
---
Returns the database level ControlledApplication represented by this UI-level ControlledApplication.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ControlledApplication ControlledApplication { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ControlledApplication As ControlledApplication
	Get
```

Visual C++
---
```text
public:
property ControlledApplication^ ControlledApplication {
	ControlledApplication^ get ();
}
```

# See Also
UIControlledApplication Class
Autodesk.Revit.UI Namespace